Ракович_В_Ю_70189466/src/InformationRegisters/ОграниченияПоНагрузкам/ОграниченияПоНагрузкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОграниченияПоНагрузкам</name>
  <attributes>
    <name>УровеньОграничения</name>
    <type>
      <types>EnumRef.УровеньОграничения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ОсвобождениеОтСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Ракович_В_Ю_70189466/src/InformationRegisters/ОграниченияПоНагрузкам/ManagerModule.bsl
// Получить активные ограничения студента
Функция ПолучитьАктивныеОграничения(Студент, НаДату = Неопределено) Экспорт
    
    Если НаДату = Неопределено Тогда
        НаДату = ТекущаяДата();
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ОграниченияПоНагрузкам.ВидНагрузки,
    |    ОграниченияПоНагрузкам.УровеньОграничения,
    |    ОграниченияПоНагрузкам.ДатаОкончания,
    |    ОграниченияПоНагрузкам.Причина
    |ИЗ
    |    РегистрСведений.ОграниченияПоНагрузкам КАК ОграниченияПоНагрузкам
    |ГДЕ
    |    ОграниченияПоНагрузкам.Студент = &Студент
    |    И ОграниченияПоНагрузкам.Активно = ИСТИНА
    |    И ОграниченияПоНагрузкам.ДатаНачала <= &НаДату
    |    И (ОграниченияПоНагрузкам.ДатаОкончания >= &НаДату
    |        ИЛИ ОграниченияПоНагрузкам.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
    |
    |УПОРЯДОЧИТЬ ПО
    |    ОграниченияПоНагрузкам.УровеньОграничения УБЫВ";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("НаДату", НаДату);
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции

// Проверить возможность занятия
Функция ПроверитьВозможностьЗанятия(Студент, ВидНагрузки, НаДату = Неопределено) Экспорт
    
    Если НаДату = Неопределено Тогда
        НаДату = ТекущаяДата();
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ВЕРХ 1
    |    ОграниченияПоНагрузкам.УровеньОграничения
    |ИЗ
    |    РегистрСведений.ОграниченияПоНагрузкам КАК ОграниченияПоНагрузкам
    |ГДЕ
    |    ОграниченияПоНагрузкам.Студент = &Студент
    |    И ОграниченияПоНагрузкам.Активно = ИСТИНА
    |    И (ОграниченияПоНагрузкам.ВидНагрузки = &ВидНагрузки
    |        ИЛИ ОграниченияПоНагрузкам.ВидНагрузки = ""Общие ограничения"")
    |    И ОграниченияПоНагрузкам.ДатаНачала <= &НаДату
    |    И (ОграниченияПоНагрузкам.ДатаОкончания >= &НаДату
    |        ИЛИ ОграниченияПоНагрузкам.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
    |
    |УПОРЯДОЧИТЬ ПО
    |    ОграниченияПоНагрузкам.УровеньОграничения УБЫВ";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("ВидНагрузки", ВидНагрузки);
    Запрос.УстановитьПараметр("НаДату", НаДату);
    
    Результат = Запрос.Выполнить();
    Если Не Результат.Пустой() Тогда
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        Возврат Выборка.УровеньОграничения;
    КонецЕсли;
    
    Возврат Перечисления.УровеньОграничения.НетОграничений;
    
КонецФункции
